#include<iostream>
using namespace std;
void ShowTrainerDesc() {
	cout << "***************************************************************************" << endl;
	cout << "                           小学运算练习系统说明" << endl;
	cout << "***************************************************************************" << endl;
	cout << "*1.本系统是一个1000以内加减乘除的运算练习系统(结果不一定为1000以内)       *" << endl;
	cout << "*2.用户可以在开始练习后选择加减乘除的单独运算或者混合运算                 *" << endl;
	cout << "*3.模式介绍：                                                             *" << endl;
	cout << "*  ->加法模式：                                                           *" << endl;
	cout << "*    $系统随机生成n个1000以内的整数并将生成后得到的加法算式显示出来       *" << endl;
	cout << "*    $n的取值[2,5]                                                        *" << endl;
	cout << "*    $用户在每次输入计算结果后无论对错均可选择是否返回“模式选择菜单”    *" << endl;
	cout << "*  ->减法模式：                                                           *" << endl;
	cout << "*    $系统随机生成n个1000以内的整数并将生成后得到的减法算式显示出来       *" << endl;
	cout << "*    $n的取值[2,5]                                                        *" << endl;
	cout << "*    $用户在每次输入计算结果后无论对错均可选择是否返回“模式选择菜单”    *" << endl;
	cout << "*  ->乘法模式：                                                           *" << endl;
	cout << "*    $系统随机生成2个100以内的整数并将生成后得到的乘法算式显示出来        *" << endl;
	cout << "*    $用户在每次输入计算结果后无论对错均可选择是否返回“模式选择菜单”    *" << endl;
	cout << "*  ->除法模式：                                                           *" << endl;
	cout << "*    $系统随机生成2个1000以内的整数并将生成后得到的除法算式显示出来       *" << endl;
	cout << "*    $用户所计算的结果只要误差在1e-6范围内均算正确                        *" << endl;
	cout << "*    $用户在每次输入计算结果后无论对错均可选择是否返回“模式选择菜单”    *" << endl;
	cout << "*    $tips：如果被除数大于300，则除数不会超过100                          *" << endl;
	cout << "*  ->混合运算：                                                           *" << endl;
	cout << "*    $系统随机生成6个150以内的整数并将生成后得到的混合运算式子显示出来    *" << endl;
	cout << "*    $用户在每次输入计算结果后无论对错均可选择是否返回“模式选择菜单”    *" << endl;
	cout << "*    $tips：混合运算暂不涉及括号/除法运算                                 *" << endl;
	cout << "***************************************************************************" << endl;
}
