#include<iostream>
using namespace std;
void ShowMainMenu() {
	cout << "****************************************************************" << endl;
	cout << "                      小学运算练习系统" << endl;
	cout << "****************************************************************" << endl;
	cout << "*                       1.开始练习                             *" << endl;
	cout << "*                       2.系统说明                             *" << endl;
	cout << "*                       3.退出系统                             *" << endl;
	cout << "****************************************************************" << endl;
}