#include<iostream>
using namespace std;
void ShowPatternMenu() {
	cout << "****************************************************************" << endl;
	cout << "                      练习模式选择菜单" << endl;
	cout << "****************************************************************" << endl;
	cout << "*                       1.加法运算                             *" << endl;
	cout << "*                       2.减法运算                             *" << endl;
	cout << "*                       3.乘法运算                             *" << endl;
	cout << "*                       4.除法运算                             *" << endl;
	cout << "*                       5.混合运算                             *" << endl;
	cout << "*                       6.返回主菜单                           *" << endl;
	cout << "****************************************************************" << endl;
}